import React from "react";
import ProgramElement from "./ProgramElement";
import "../styles/ProgramElements.css";

const ProgramElements = () => {

    const programInfo = [
        {
            number: 1,
            text: "Знайомство з компанією: кількість аптек та структурних підрозділів, як вони пов’язані між собою. Які можливості надає компанія для професійного та особистого розвитку. Умови праці, грошове та соціальне забезпечення."
        },
        {
            number: 2,
            text: "Надання належної фармацевтичної допомоги. Фармацевтична опіка, консультування. Програмне забезпечення що забезпечує реалізацію лікарських засобів, та електронні асистенти фармацевт."
        },
        {
            number: 3,
            text: "Адміністрування. Вивчення процесів що забезпечують функціонування аптечного закладу: замовлення товару, його приймання, контроль якості, розміщення в зонах зберігання відповідно специфічних умов. Проведення інкасацій, інвентаризації, управління товарним запасом аптеки."
        },
        {
            number: 4,
            text: "Фармацевтичний маркетинг. Мерчандайзинг в аптеках, робота з планограмами. Дисконт, що робить покупки вигіднішими."
        },
        {
            number: 5,
            text: "Корпоративні стандарти, політики та корпоративна культура."
        }

    ]

    return (
        <div className="program-elements-container">
            <h1>Програма навчання</h1>
            {programInfo.map((data, index) => (
                <ProgramElement 
                key = {index}
                number = {data.number}
                text = {data.text}
                />
            ))}
        </div>
    )
}

export default ProgramElements;